In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

titanic = sns.load_dataset('titanic')

### Q. titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 df를 만드세요

In [2]:
df = titanic[['age','fare']]
display(df.head(),type(df))

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

pandas.core.frame.DataFrame

### Q. 10을 더하는 함수 add_10 과 두 객체의 합 add_two_obj 함수를 정의한 후 결과값이 각각 20과 20을 출력하세요.

In [3]:
def add_10(a):
    return a+10

def add_two_obj(a,b):
    return a+b

print(add_10(10),add_two_obj(10,10))

20 20

### Q. 10을 곱하는 사용자 함수와 두 객체의 나눗셈을 수행하는 사용자 함수를 정의한 후 결과값이 각각 200과 10을 출력하세요.

In [4]:
def mul_10(a):
    return a*10
def div_two_obj(a,b):
    try:
        return round(a/b,2)
    except ZeroDivisionError:
        print('두 번째 인자는 0이 될 수 없습니다.')

print(mul_10(20),int(div_two_obj(100,10)))

200 10

In [6]:
df[['age']].head()

    age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

### Q.df_age 에 add_10 함수를 적용해서 출력하세요.

In [77]:
df[['age']].apply('add_10')
# display(add_10(df[['age']].fillna(0)).head()) # 데이터프레임
# display(df.age.fillna(0).map(add_10).head()) # 시리즈
# display(add_10(df['age'].fillna(0)).head()) # 시리즈. 차이는 []의 개수 차이임

    age
0  32.0
1  48.0
2  36.0
3  45.0
4  45.0

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

### Q. 시리즈 객체 + 숫자를 연산하는 방식으로 df.age에 10을 더한 후 sr2에 저장하고 출력하세요.

In [8]:
sr2 = df['age'].fillna(0)+10 # df.age.fillna(0)도 됨. 걍 표기방식 차이이니까 내 손에 맞는 걸로~
print(sr2.head(),'\n',type(sr2))

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64
 <class 'pandas.core.series.Series'>

### Q. 람다 함수를 활용해서 위와 같은 연산을 수행하고 결과를 sr3로 출력하세요.

In [10]:
sr3 = df['age'].fillna(0).apply(lambda x:add_10(x))
sr3.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

### Q. df의 'age', 'fare' 칼럼에 10을 더하는 사용자 함수를 정의하고 applymap()으로 각 사용자 함수를 매핑한 후 출력하세요.

In [12]:
def add_10(n):
    return n + 10

df_map = df.applymap(add_10)
df_map.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

### Q. df_map의 [0,0]을 NaN으로 변경한 후 missing_value 함수를 적용해서 불린 시리즈를 반환하세요.

In [13]:
def missing_value(series):
    return series.isnull()

df_map.iloc[0,0] = np.nan
result = df_map.apply(missing_value,axis=0)
print(result.head())

     age   fare
0   True  False
1  False  False
2  False  False
3  False  False
4  False  False

### Q. titanic 데이터셋을 seaborn에서 로딩한 후 블린 인덱싱을 이용하여 아래 사항들을 수행하세요.
- 나이가 10대(10~19세)인 승객만 따로 선택
- 나이가 10세 미만(0~9세)이고 여성인 승객만 따로 선택
- 나이가 10세 미만(0~9세) 또는 60세 이상인 승객의 age, sex, alone 열만 선택

In [14]:
# 나이가 10대(10~19세)인 승객만 따로 선택
display(titanic[(titanic['age']>=10)&(titanic['age']<20)].head())

# 나이가 10세 미만(0~9세)이고 여성인 승객만 따로 선택
display(titanic[(titanic['age']<10) & (titanic['sex']=='female')].head())

# 나이가 10세 미만(0~9세) 또는 60세 이상인 승객의 age, sex, alone 열만 선택
display(titanic[(titanic['age']<10)|(titanic['age']>=60)][['age','sex','alone']].head())

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
38,0,3,female,18.0,2,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
24,0,3,female,8.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
43,1,2,female,3.0,1,2,41.5792,C,Second,child,False,NaN,Cherbourg,yes,False
58,1,2,female,5.0,1,2,27.7500,S,Second,child,False,NaN,Southampton,yes,False
119,0,3,female,2.0,4,2,31.2750,S,Third,child,False,NaN,Southampton,no,False

     age     sex  alone
7    2.0    male  False
10   4.0  female  False
16   2.0    male  False
24   8.0  female  False
33  66.0    male   True

## Q. 나이가 10세 미만(0~9세) 또는 60세 이상인 승객의 alone 열만 선택한 후 값을 True로 변경하세요

In [16]:
df_m3 = titanic.loc[(titanic.age < 10)|(titanic.age>=60),'alone']
print(df_m3[:5],'\n')
titanic.loc[(titanic.age < 10)|(titanic.age>=60),'alone'] = True
df_m5 = titanic.loc[(titanic.age < 10)|(titanic.age>=60),'alone']
df_m5[:5]

7     False
10    False
16    False
24    False
33     True
Name: alone, dtype: bool

7     True
10    True
16    True
24    True
33    True
Name: alone, dtype: bool

In [15]:
def gettrue(a):
    return True

tsr = titanic[(titanic['age']<10)|(titanic['age']>=60)]['alone']
# alone열 [] 하나뿐이라 시리즈타입
# titanic['alone'].map(gettrue) # 이렇게 하면 되는데 왜 추린 것에 넣으면 안 되나..?
tsr.map(gettrue) # 원본 반영 안 돼서 그런 듯 ㅋㅋ
# display(tsr) 하면 값 변경 전의 원본 나옴

7      True
10     True
16     True
24     True
33     True
       ...
831    True
850    True
851    True
852    True
869    True
Name: alone, Length: 88, dtype: bool

### Q. 최대값 - 최소값을 반환하는 사용자 함수를 min_max로 정의하고 age, fare 열로 구성되는 타이타닉 데이터프레임df 에 적용하여 결과와 자료형을 출력하세요. source : titanic = sns.load_dataset('titanic')

In [17]:
def min_max(a):
    return a.max()-a.min()

# print(min_max(df),'\n',type(min_max(df)))
print(df.apply(min_max),'\n',type(min_max(df)))

age      79.5800
fare    512.3292
dtype: float64
 <class 'pandas.core.series.Series'>

### Q. df 에서 'age' 칼럼과 'fare'칼럼을 더한 가격을 리턴하는 사용자 함수를 정의한 후 df['add'] 변수를 생성하여 출력하세요.(lambda 함수 사용)

In [18]:
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [19]:
def add_two_obj(a,b):
    return a + b
df['add'] = df.apply(lambda x:add_two_obj(x['age'],x['fare']),axis=1)
df.head()

    age     fare       add
0  22.0   7.2500   29.2500
1  38.0  71.2833  109.2833
2  26.0   7.9250   33.9250
3  35.0  53.1000   88.1000
4  35.0   8.0500   43.0500

In [118]:
def addcol(a):
    return a.iloc[:,0] + a.iloc[:,1]
# 사용자 함수를 만들 때 변수를 데이터프레임으로 가정하고 짠 만큼
# 각 원소에 매핑하는 게 아니라 입력되는 타입에 따라 다양한 형태로 반환하는 pipe 함수를 쓰는 것이 좋다
df1 = df.copy()
df1['add'] = df1.pipe(lambda x:addcol(x)) # 반환값은 시리즈
df1.head()

    age     fare       add
0  22.0   7.2500   29.2500
1  38.0  71.2833  109.2833
2  26.0   7.9250   33.9250
3  35.0  53.1000   88.1000
4  35.0   8.0500   43.0500

### Q. 'age', 'fare' 두개 칼럼으로 구성되는 titanic 데이터프레임에서 [0,1]의 값을 NaN으로 변경한 후 df 이름으로 출력하세요.

In [56]:
df.iloc[0,1] = np.nan
df.head()

    age     fare
0  22.0      NaN
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

### Q. 각 열의 NaN 찾기, 각 열의 NaN 개수 반환, 데이터프레임의 총 NaN 개수를 반환하는 사용자 함수를 정의한 후 df.pipe 메소드로 함수 매핑한 결과를 모두 출력하세요.

In [20]:
def findn(a):
    return a.isnull()
def sumnan(a):
    return a.isnull().sum()
def sumnanall(a):
    return a.isnull().sum().sum()

df2 = df.copy()
display(df2.pipe(findn).tail(5))
print(df2.pipe(sumnan),'\n')
print(df2.pipe(sumnanall))

       age   fare    add
886  False  False  False
887  False  False  False
888   True  False   True
889  False  False  False
890  False  False  False

age     177
fare      0
add     177
dtype: int64

354

### Q. 타이타닉 df의 열 순서를 아래와 같이 재구성하고 출력하세요
* 열 선택 : ['pclass', 'sex', 'age', 'survived'].
* 열 이름의 리스트 만들기
* 열 이름을 알파벳 순으로 정렬하기
* 열 이름을 기존 순서의 정반대 역순으로 정렬하기
* 열 이름을 사용자가 정의한 임의의 순서로 재배치하기

In [22]:
tdf = sns.load_dataset('titanic')
tdf = tdf[['pclass', 'sex', 'age', 'survived']]
print(tdf.head(),'\n')

print(list(tdf.columns),'\n')

columns = list(tdf.columns)
columns_sorted = sorted(columns)
tdf_sorted = tdf[columns_sorted]
print(tdf_sorted.head(),'\n')

columns_reversed = list(reversed(columns))
tdf_reversed = tdf[columns_reversed]
print(tdf_reversed.head(),'\n')

columns_customed = ['pclass', 'sex', 'age', 'survived']
tdf_customed = tdf[columns_customed]
print(tdf_customed.head())

   pclass     sex   age  survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0

['pclass', 'sex', 'age', 'survived']

    age  pclass     sex  survived
0  22.0       3    male         0
1  38.0       1  female         1
2  26.0       3  female         1
3  35.0       1  female         1
4  35.0       3    male         0

   survived   age     sex  pclass
0         0  22.0    male       3
1         1  38.0  female       1
2         1  26.0  female       3
3         1  35.0  female       1
4         0  35.0    male       3

   pclass     sex   age  survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0

In [23]:
# 열 선택 : ['pclass', 'sex', 'age', 'survived']
ttdf = pd.DataFrame(titanic,columns=['pclass', 'sex', 'age', 'survived'])

# 열 이름의 리스트 만들기
print(ttdf.columns.tolist())

# 열 이름을 알파벳 순으로 정렬하기
col = np.sort(ttdf.columns.tolist())
display(pd.DataFrame(ttdf,columns=col).head())

# 열 이름을 기존 순서의 정반대 역순으로 정렬하기
col = ttdf.columns.tolist()
display(pd.DataFrame(ttdf,columns=col[::-1]).head())

# 열 이름을 사용자가 정의한 임의의 순서로 재배치하기
# 완전 랜덤
col1 = ttdf.columns.tolist()
np.random.shuffle(col1)
display(pd.DataFrame(ttdf,columns=col1).head())

# 내가 입력해서 재배치
col1 = ttdf.columns.tolist()
def col4(a,b,c,d):
    global col1 # ['pclass', 'sex', 'age', 'survived']
    return [col1[a],col1[b],col1[c],col1[d]]

display(pd.DataFrame(ttdf,columns=col4(0,2,3,1)).head())

['pclass', 'sex', 'age', 'survived']

    age  pclass     sex  survived
0  22.0       3    male         0
1  38.0       1  female         1
2  26.0       3  female         1
3  35.0       1  female         1
4  35.0       3    male         0

   survived   age     sex  pclass
0         0  22.0    male       3
1         1  38.0  female       1
2         1  26.0  female       3
3         1  35.0  female       1
4         0  35.0    male       3

   survived  pclass   age     sex
0         0       3  22.0    male
1         1       1  38.0  female
2         1       3  26.0  female
3         1       1  35.0  female
4         0       3  35.0    male

   pclass   age  survived     sex
0       3  22.0         0    male
1       1  38.0         1  female
2       3  26.0         1  female
3       1  35.0         1  female
4       3  35.0         0    male